In [20]:
import pandas as pd
import numpy as np
import scipy

In [2]:
import io

data = io.StringIO("a,b\n,True\n2,")

df = pd.read_csv(data)

In [3]:
df

     a     b
0  NaN  True
1  2.0   NaN

In [4]:
df.dtypes

a    float64
b     object
dtype: object

In [5]:
df_conv = df.convert_dtypes()

In [7]:
df_conv

      a     b
0  <NA>  True
1     2  <NA>

In [8]:
df_conv.dtypes

a      Int64
b    boolean
dtype: object

In [10]:
ser = pd.Series([1, np.nan, 3, np.nan])
ser

0    1.0
1    NaN
2    3.0
3    NaN
dtype: float64

In [11]:
ser.cumsum()

0    1.0
1    NaN
2    4.0
3    NaN
dtype: float64

In [12]:
ser.cumsum(skipna=False)

0    1.0
1    NaN
2    NaN
3    NaN
dtype: float64

In [13]:
data = {"np": [1.0, np.nan, np.nan, 2], "arrow": pd.array([1.0, pd.NA, pd.NA, 2], dtype="float64[pyarrow]")}

df = pd.DataFrame(data)

df

    np  arrow
0  1.0    1.0
1  NaN   <NA>
2  NaN   <NA>
3  2.0    2.0

In [14]:
df.ffill()

    np  arrow
0  1.0    1.0
1  1.0    1.0
2  1.0    1.0
3  2.0    2.0

In [15]:
df.bfill()

    np  arrow
0  1.0    1.0
1  2.0    2.0
2  2.0    2.0
3  2.0    2.0

In [16]:
df = pd.DataFrame(
    {
        "A": [1, 2.1, np.nan, 4.7, 5.6, 6.8],
        "B": [0.25, np.nan, np.nan, 4, 12.2, 14.4],
    }
)

In [17]:
df

     A      B
0  1.0   0.25
1  2.1    NaN
2  NaN    NaN
3  4.7   4.00
4  5.6  12.20
5  6.8  14.40

In [22]:
df.interpolate()

     A      B
0  1.0   0.25
1  2.1   1.50
2  3.4   2.75
3  4.7   4.00
4  5.6  12.20
5  6.8  14.40

In [21]:
df.interpolate(method="barycentric")

      A       B
0  1.00   0.250
1  2.10  -7.660
2  3.53  -4.515
3  4.70   4.000
4  5.60  12.200
5  6.80  14.400

In [23]:
df.interpolate(method="pchip")

         A          B
0  1.00000   0.250000
1  2.10000   0.672808
2  3.43454   1.928950
3  4.70000   4.000000
4  5.60000  12.200000
5  6.80000  14.400000

In [24]:
df.interpolate(method="akima")

          A          B
0  1.000000   0.250000
1  2.100000  -0.873316
2  3.406667   0.320034
3  4.700000   4.000000
4  5.600000  12.200000
5  6.800000  14.400000